posts/linux-journey.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>My Linux Journey</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/">Home</a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a>

</p>
</div>
<div id="content">
<header>
<h1 class="title">My Linux Journey</h1>
</header>
<div id="outline-container-org9c6d185" class="outline-2">
<h2 id="org9c6d185">The Freedom&#xa0;&#xa0;&#xa0;<span class="tag"><span class="distro">distro</span>&#xa0;<span class="linux">linux</span></span></h2>
<div class="outline-text-2" id="text-org9c6d185">
<p>
<b>Small info/log on my linux journey and my experience.</b>
</p>

<p>
<i>If you are reading this, I encourage you to write blogs like this and have it in your git repo. Don&rsquo;t forget to tag or inform me, I&rsquo;d be glad to read your journey too!</i>
</p>

<hr>

<p>
Linux is not widely recommended or discussed topic among real life friends or circle, every system comes pre-installed with win-dows, and its no big surprise people don&rsquo;t have a feel towards their usage of OS.
</p>

<p>
Not many people update their system, not many try to explore Alternative softwares, they stick very much to the default out-of-the-box Application. Tbh if you deep dive and understand windows, it is total crap, <b>Obnoxious</b>.
</p>

<p>
My reason to switch over to Linux was simple as other had :
</p>
<ul class="org-ul">
<li>No Freedom</li>
<li>Slow win-dows</li>
<li>Cannot even run the browser properly</li>
<li>Cannot even do multitasking efficiently</li>
<li>The bloatware crap were too much</li>
<li>Updates are like <b>eternal sleep</b> (No-sense updates)</li>
</ul>

<p>
My linux journey was from Linux Mint &gt; EndeavourOS &gt; Arch Linux &gt; and now NixOS.
</p>
</div>

<div id="outline-container-orgb329e6a" class="outline-3">
<h3 id="orgb329e6a">The Embark</h3>
<div class="outline-text-3" id="text-orgb329e6a">
<p>
I started to explore some YouTube video on Linux (as a normie at that time), soon I got familiar with good explanation, thankfully CTT had made an Linux Mint playlist and it helped to installing the first and the best <b>Beginner Distro</b>, the <b>Linux Mint</b>.
</p>

<p>
The gain and experience was <b>Ultimate</b>. Loved it, felt the Freedom, felt the deeper understanding of a <b>real System</b>.
</p>

<p>
I choose the flagship Cinnamon DE and it was very comfortable.
</p>

<p>
After few months, I finally stumbled upon a drawback here, it was stable packages (old package versions).
</p>

<p>
That is when I saw the concept of <b>Rolling release</b>, at that time <b>EndeavourOS</b> was the flavor of Linux distro at that time, peaked the distrowatch and all. So guess what, I installed EvndeavourOs and expanded more love towards terminal and latest packages.
</p>

<p>
Soon i felt i did not needed what all EndeavourOS ships, I want custom or DIY (something i take control of), then i realized, EOS was arch-based, so guess again, went with the great Independent Arch linux.
</p>

<p>
Boom, the best linux journey (learning), I only mean it for learning, other than that Arch is just cool kids bag.
</p>

<p>
Finally, now with some other jolt of distro trend, I stumbled the name <b>&ldquo;NixOS&rdquo;</b>.
It is somewhat reinventing the wheel, but it is so different that I&rsquo;d hate to even say it as a Linux distro, It stands unique with linux distros.
</p>

<p>
Tbh I loved LM and Arch alot, I was a devotee to Arch too, and I hated Nix when I tried, cause things were weird.
</p>
<ul class="org-ul">
<li>You won&rsquo;t know where to start nor what to refer</li>
<li>Flakes or home-manager, How to understand?</li>
<li>Do nix-env or rebuild all the time?</li>
<li><p>
What files to edit to achieve same setup as my previous distro?
</p>

<p>
These were all the things that I hated and was frustrated about, there was still many things that felt hard.
I did leave Nix and install Arch few times back and forth, I was debating with myself and id my own research all over Internet.
</p>

<p>
That is when I thought nix lacked Documentation or good YouTuber to speak of, I really wish one of them could explain and make it their distro to explain timely on things.
</p>

<p>
Fine, somehow forced myself and came a long way of setting up Good working nixos config, now I&rsquo;m on flakes.
</p>

<p>
Nix is great if it works as expected or if we make it work, but, if I get stuck or the issue goes for days that is when I really hate Nix, because it ain&rsquo;t easy to solve some unique issues. Most of these apply for HomeManager actually, it adds more trouble.
</p>

<p>
It is adviced to learn how Nix works or Nix as Functional Programming Language.
</p></li>
</ul>

<hr>

<p>
Okay, so it was not about shilling Nix or anything, Just my Linux experience.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
2023 - <b>Dilip<sup></sup></b>- Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
